# BuiltInFailures.SystemNavigatorFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SystemNavigatorFailures Class
BuiltInFailures Class Members See Also
---
Failures related with the system browser.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SystemNavigatorFailures
```

Visual Basic
---
```text
Public NotInheritable Class SystemNavigatorFailures
```

Visual C++
---
```text
public ref class SystemNavigatorFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SystemNavigatorFailures
# See Also
BuiltInFailures..::..SystemNavigatorFailures Members
Autodesk.Revit.DB Namespace